IDEA Open Model
CrackWidthRequirementsSIA Enumeration
Compatible with IDEA StatiCa Beta 20.0
 crack width requirement
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum CrackWidthRequirementsSIA
Public Enumeration CrackWidthRequirementsSIA
Members
Member name | Value | Description
NotNecessary | 0 |  calculation is nod defined it means not necessary
A | 1 |  type A
B | 2 |  type B
C | 3 |  type C
Value | 4 |  value is define as fsd-value
See Also
Reference
IdeaRS.OpenModel.Material Namespace